newwms_gift/src/Documents/ит_WMS_ТоварыВПути/ит_WMS_ТоварыВПути.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ит_WMS_ТоварыВПути</name>
  <comment>Перевыпуск старого механизма под управляемые формы</comment>
  <registerRecords>AccumulationRegister.итТоварыВПути</registerRecords>
  <attributes>
    <name>ДатаВходящего</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящего</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГУИД_Входящего</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.итФилиалыWMS</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОприходования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПоступления</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПриемки</name>
    <type>
      <types>DocumentRef.итWMSПриемка</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.ит_WMS_СтатусыТоваровВПути</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияДанныхВходящего</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторТоварныхПозиций</name>
      <type>
        <types>CatalogRef.итИндентификаторыТоварныхПозиций</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

newwms_gift/src/Documents/ит_WMS_ТоварыВПути/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПривязатьДокументПоступления(Команда)
	Оповещение=новый ОписаниеОповещения("ПривязатьДокументПоступленияОповещение",ЭтаФорма);
	ПоказатьВопрос(Оповещение,"После привзяки проведенного поступления товаров услуг к документу, документ перейдет к статусу принят. 
	|Вы уверенны, что хотите привязать документ поступления???",РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ПривязатьДокументПоступленияОповещение(Результат,Параметры) Экспорт 
	Если Результат=КодВозвратаДиалога.Нет Тогда 
		Возврат
	КонецЕсли;
	ОткрытьФорму("Документ.ит_WMS_ТоварыВПути.Форма.ФормаПривязкиПоступления",,ЭтаФорма);
	КонецПроцедуры
	
&НаКлиенте
Процедура Очистить(Команда)
Оповещение=новый ОписаниеОповещения("ОчиститьОповещение",ЭтаФорма);
ПоказатьВопрос(Оповещение,"Вы уверенны, что хотите отвязать документ поступления???",РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОповещение(Результат,Параметры) Экспорт 
Если Результат=КодВозвратаДиалога.Нет Тогда 
	Возврат
КонецЕсли;
ОчиститьОтПоступленияНаСервере(Объект.ДокументПоступления);
Объект.ДокументПоступления=Неопределено;
КонецПроцедуры

Процедура ОчиститьОтПоступленияНаСервере(ПТУ)
	ОбъектИзменения=ПТУ.ПолучитьОбъект();
	ОбъектИзменения.ит_WMS_ГУИД_ДокументаТранизата=новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	ОбъектИзменения.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если  ИсточникВыбора.ИмяФормы="Документ.ит_WMS_ТоварыВПути.Форма.ФормаПривязкиПоступления" Тогда 
		ПривязатьПТУ(ВыбранноеЗначение);
		Объект.ДокументПоступления=ВыбранноеЗначение;
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура ПривязатьПТУ(ПТУ)
ОбъектИзменения=ПТУ.ПолучитьОбъект();
ОбъектИзменения.ит_WMS_ГУИД_ДокументаТранизата=Объект.ГУИД_Входящего;
ОбъектИзменения.Записать();
	КонецПроцедуры
